import React from "react";
import Svg, { Path } from "react-native-svg";

interface HandPointerProps {
  size?: number;
  color?: string;
}

export default function HandPointer({
  size = 60, // 기본 크기
  color = "#FFD700", // 기본 색상 (노란색)
}: HandPointerProps) {
  return (
    <Svg width={size} height={size} viewBox="0 0 24 24" fill="none">
      <Path
        d="M12 2C9.23858 2 7 4.23858 7 7V15.4L4.29289 12.7071C3.90237 12.3166 3.2692 12.3166 2.87868 12.7071C2.48816 12.0976 2.48816 11.4645 2.87868 11.074L8.17157 5.78111C8.82796 5.12471 9.71869 4.75 10.6569 4.75H15.5C17.433 4.75 19 6.317 19 8.25V16.75C19 18.683 17.433 20.25 15.5 20.25V20.25C13.567 20.25 12 18.683 12 16.75V7C12 6.31 11.45 5.75 10.75 5.75C10.05 5.75 9.5 6.31 9.5 7V14C9.5 14.69 8.94 15.25 8.25 15.25C7.56 15.25 7 14.69 7 14V11C7 10.31 6.45 9.75 5.75 9.75C5.05 9.75 4.5 10.31 4.5 11V17C4.5 18.933 6.067 20.5 8 20.5V20.5C9.933 20.5 11.5 18.933 11.5 17V15.8544C11.6667 15.9518 11.8333 16.0491 12 16.1464V16.75C12 18.683 13.567 20.25 15.5 20.25V20.25C17.433 20.25 19 18.683 19 16.75V8.25C19 5.654 17.42 3.35 14.85 2.44C14.29 2.24 13.7 2.093 13.1 2"
        stroke="black" // 테두리 색상
        strokeWidth="0.5" // 테두리 굵기
        strokeLinecap="round"
        strokeLinejoin="round"
        fill={color} // 손가락 내부 색상
      />
    </Svg>
  );
}
